tutorials/multiphase/overInterDyMFoam/boatAndPropeller/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset1
    {
        type            overset;
        value           uniform 0;
    }

    overset2
    {
        type            overset;
        value           uniform 0;
    }

    overset3
    {
        type            overset;
        value           uniform 0;
    }

    hullWall
    {
        type            zeroGradient;
    }

    propellerWall
    {
        type            zeroGradient;
    }

    rudderWall
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
